app/controllers/carts_controller.rb

INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2012-07-25 07:52:10.000000', '2012-07-25 07:52:10.000000')
---
  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save