app/controllers/line_items_controller.rb

  def create
	@cart = current_cart
	product = Product.find(params[:product_id])
	@line_item = @cart.add_product(product.id)

  respond_to do |format|
    if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2012-07-25 07:43:23.829834', '2012-07-25 07:43:23.829834')
INSERT INTO "line_items" ("updated_at", "order_id", "created_at", "cart_id", "quantity", "product_id") VALUES ('2012-07-26 09:40:53.791612', NULL, '2012-07-26 09:40:53.791612', 980190963, 1, 207281424)
UPDATE "line_items" SET "updated_at" = '2012-07-25 08:12:42.570428', "quantity" = 2 WHERE "line_items"."id" = 3