app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate :page => params[:page], :order=>'created_at desc',
      :per_page => 10
---
SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 36)
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 36)

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver
---
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2012-07-26 08:09:48.434011', '2012-07-26 08:09:48.434011')
INSERT INTO "orders" ("email", "address", "updated_at", "name", "created_at", "pay_type") VALUES ('1198156572@qq.com', 'asdfasdfa', '2012-07-26 08:30:57.442594', 'adsfsdf', '2012-07-26 08:30:57.442594', 'Purchase order')
DELETE FROM "carts" WHERE "carts"."id" = 43
SELECT "line_items".* FROM "line_items" WHERE ("line_items".order_id = 122)