app/controllers/products_controller.rb

  def show
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1

  def edit
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 4 ORDER BY title LIMIT 1

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("updated_at", "image_url", "price", "title", "created_at", "description") VALUES ('2012-07-25 01:12:19.578159', '/images/wd4d.jpg', 42.95, 'Web Design for Developers', '2012-07-25 01:12:19.578159', '<p>

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
UPDATE "products" SET "updated_at" = '2012-07-26 03:55:42.237363', "title" = 'Lorem Ipsum', "price" = 19.95, "image_url" = 'lorem.jpg', "description" = 'Wibbles are fun!' WHERE "products"."id" = 980190962

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 1

  def who_bought
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1