app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("salt", "name", "created_at", "updated_at", "hashed_password") VALUES ('703973400.820366016252885', 'zhong', '2012-07-26 14:26:22.393448', '2012-07-26 14:26:22.393448', 'fa3a8e328cee3f1df4a30f77156f697a655fcbb8f2e44101ba7793be5b6188b1')

  def destroy
    @user = User.find(params[:id])
	begin
      @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 1